daiilvvyeyo/WRO-2026-Future-Engineers-Superiores/codes/ESP32_Open_Optimizado.ino
#include <Wire.h>
#include <Adafruit_BNO08x.h>
#include <WiFi.h>
#include <WebServer.h>
#include <esp_arduino_version.h>
#include <math.h>
#include <stdlib.h>

// ====================================================================
//                  VARIABLES PARA CALIBRAR EL ROBOT
// ====================================================================

// ----------------------- VELOCIDAD DEL MOTOR ------------------------
// Estos son los valores principales para ajustar el movimiento.
// Rango permitido: 0 (detenido) a 100 (velocidad maxima).
constexpr uint8_t VELOCIDAD_MOTOR_PORCENTAJE = 100;
constexpr uint8_t VELOCIDAD_MOTOR_EN_ESQUINA_PORCENTAJE = 70;
constexpr uint8_t VELOCIDAD_MINIMA_PARED_LATERAL_PORCENTAJE = 70;
constexpr uint8_t VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE = 45;

// Mientras el interruptor de potencia del motor esta abierto, el ESP32 sigue
// encendido. Se mantiene este PWM bajo preparado y la rampa no comienza hasta
// que el encoder confirma que el motor realmente se movio.
constexpr uint8_t VELOCIDAD_DETECCION_ARRANQUE_PORCENTAJE = 45;
constexpr uint8_t PULSOS_ENCODER_PARA_ARRANCAR = 4;
constexpr unsigned long VENTANA_DETECCION_MOVIMIENTO_MS = 600;
constexpr unsigned long DURACION_ARRANQUE_SUAVE_MS = 5000;

// Cambia entre true y false para invertir el sentido del motor.
constexpr bool INVERTIR_DIRECCION_MOTOR = true;

// Pines del canal A del TB6612FNG: PWMA, AIN2 y AIN1.
constexpr uint8_t MOTOR_PWM_PIN = D6;
constexpr uint8_t MOTOR_AIN2_PIN = D7;
constexpr uint8_t MOTOR_AIN1_PIN = D8;

// El esquema de la PCB conecta ENC_A3.3 a D5 y ENC_B3.3 a D9.
// Para detectar movimiento basta contar los flancos del canal A; el canal B
// queda configurado para poder agregar direccion/odometria mas adelante.
constexpr uint8_t ENCODER_A_PIN = D5;
constexpr uint8_t ENCODER_B_PIN = D9;

// ----------------------- CONTEO DE VUELTAS --------------------------
// El modulo GY-BNO085 usa 0x4B por defecto; ADDR en LOW selecciona 0x4A.
// El programa intenta ambas direcciones automaticamente sobre SDA=21/SCL=22.
constexpr uint8_t BNO085_I2C_ADDRESS_PRIMARY = 0x4B;
constexpr uint8_t BNO085_I2C_ADDRESS_SECONDARY = 0x4A;
constexpr uint32_t BNO085_REPORT_INTERVAL_US = 10000;
constexpr uint8_t VUELTAS_OBJETIVO = 3;
constexpr float GRADOS_POR_VUELTA = 360.0f;

// Seguro suave cada 90 grados. Poco antes del angulo reduce velocidad y
// limita el volante; al alcanzarlo centra brevemente el servo para evitar
// que el robot siga cerrando la curva por inercia.
constexpr bool SEGURO_CADA_90_HABILITADO = true;
constexpr float GRADOS_POR_ESQUINA = 90.0f;
constexpr float ANTICIPACION_SEGURO_90_GRADOS = 10.0f;
constexpr int CORRECCION_MAXIMA_PREVIA_90_GRADOS = 15;
constexpr uint8_t VELOCIDAD_SEGURO_90_PORCENTAJE = 60;
constexpr unsigned long DURACION_SERVO_CENTRADO_90_MS = 350;

// Al salir de cada esquina, devuelve gradualmente el mando al PID para evitar
// que una lectura lateral extrema produzca un volantazo inmediato.
constexpr unsigned long DURACION_REENTRADA_PID_90_MS = 300;

// Maximo cambio solicitado al servo entre dos paquetes de sensores. Conserva
// el angulo objetivo, pero evita saltos por ruido de los ultrasonicos.
constexpr int PASO_MAXIMO_SERVO_POR_LECTURA_GRADOS = 10;

// El ancho inicial se obtiene promediando S1 + S5 mientras el robot permanece
// quieto. Esa clasificacion selecciona el avance posterior a la tercera vuelta.
constexpr uint8_t MUESTRAS_PARA_CLASIFICAR_PASILLO = 10;
constexpr uint16_t UMBRAL_PASILLO_ANCHO_MM = 1000;
constexpr unsigned long DURACION_AVANCE_FINAL_PASILLO_ANCHO_MS = 250;
constexpr unsigned long DURACION_AVANCE_FINAL_PASILLO_ANGOSTO_MS = 2500;

// Al terminar, si S3 ve la pared a menos de 100 cm, retrocede hasta que la
// distancia supere 110 cm. El BNO085 mantiene el giro total en +/-1080 grados.
constexpr uint16_t DISTANCIA_INICIO_AJUSTE_FINAL_MM = 1000;
constexpr uint16_t DISTANCIA_SALIDA_AJUSTE_FINAL_MM = 1100;
constexpr uint8_t VELOCIDAD_AJUSTE_FINAL_PORCENTAJE = 35;
constexpr unsigned long DURACION_FRENO_AJUSTE_FINAL_MS = 150;
constexpr unsigned long DURACION_MAXIMA_AJUSTE_FINAL_MS = 5000;
constexpr float KP_RUMBO_AJUSTE_FINAL = 2.0f;
constexpr int DIRECCION_SERVO_AJUSTE_FINAL = -1;
constexpr int CORRECCION_MAXIMA_AJUSTE_FINAL_GRADOS = 20;

// Descarta saltos imposibles de rumbo producidos por un paquete corrupto o
// por reiniciar/desconectar el sensor.
constexpr float CAMBIO_RUMBO_MAXIMO_GRADOS = 90.0f;

// Si deja de llegar el rumbo durante la carrera, se detiene el robot.
constexpr unsigned long BNO085_FAILSAFE_TIMEOUT_MS = 500;

// Durante la puesta a punto, una falla del BNO085 solo desactiva el conteo de
// vueltas; no bloquea el control existente del motor ni del servo. Cuando el
// sensor ya este validado, puede cambiarse a true para exigirlo en competencia.
constexpr bool EXIGIR_BNO085_PARA_MOVERSE = false;

// -------------------------- DASHBOARD WIFI -------------------------
// true para pruebas y practicas. Cambia a false para una ronda: el radio WiFi
// queda apagado y el servidor no consume tiempo de procesamiento.
constexpr bool DASHBOARD_HABILITADO = true;
constexpr char DASHBOARD_WIFI_NOMBRE[] = "WRO-Open";
constexpr char DASHBOARD_WIFI_CLAVE[] = "wroopen26";
constexpr unsigned long DASHBOARD_UPDATE_INTERVAL_MS = 250;

// --------------------- DIRECCION Y SENSORES -------------------------

// S1 y S2 se consideran sensores del lado izquierdo.
// S3 se considera el sensor frontal.
// S4 y S5 se consideran sensores del lado derecho.
//
// Error usado:
//   (S1 * PESO_S1 + S2 * PESO_S2)
//   -
//   (S4 * PESO_S4 + S5 * PESO_S5)
//
// Ajusta los pesos segun la posicion de los sensores y el ancho del pasillo.
constexpr float PESO_S1 = 1.0f;
constexpr float PESO_S2 = 1.0f;
constexpr float PESO_S4 = 1.0f;
constexpr float PESO_S5 = 1.0f;

// ----------------------------- PID ----------------------------------
// KP: aumenta la reaccion inmediata para alejarse de la pared.
// KI: corrige una desviacion pequena que se mantiene durante varios segundos.
// KD: anticipa cambios rapidos; ayuda a reaccionar antes, pero demasiado
//     valor puede causar vibracion por el ruido de los ultrasonicos.
constexpr float KP = 0.04f;    ////////////////////////////////////////////////////////////////////////////////// KP
constexpr float KI = 0.001f;
constexpr float KD = 0.003f;

