daiilvvyeyo/WRO-2026-Future-Engineers-Superiores/codes/ESP32_Open_Optimizado.ino
// Durante la espera de movimiento, Kp comienza en esta fraccion de su valor
// normal. Al iniciar la rampa del motor, sube linealmente hasta 100% durante
// DURACION_ARRANQUE_SUAVE_MS. Por ejemplo, 0.50 deja Kp a la mitad.
constexpr float MULTIPLICADOR_KP_INICIAL = 0.50f;

// Limita la contribucion integral para evitar que el control se acumule.
constexpr float LIMITE_INTEGRAL_GRADOS = 8.0f;

// 0 filtra completamente la derivada; 1 no aplica filtro.
constexpr float FILTRO_DERIVADA = 0.25f;

// Si el robot gira hacia el lado equivocado, cambia 1 por -1.
constexpr int8_t DIRECCION_SERVO = -1;

// Durante la REVERSA de escape, el efecto del volante sobre el rumbo se
// invierte respecto al avance. Por eso se usa una direccion independiente.
// 1 = servo hacia +angulo produce giro del robot en sentido positivo al
// retroceder; -1 = produce giro en sentido negativo.
constexpr int8_t DIRECCION_SERVO_REVERSA = 1;
constexpr int ANGULO_GUIA_RETROCESO_GRADOS = 18;
constexpr float UMBRAL_SENTIDO_RETROCESO_GRADOS = 12.0f;

// Configuracion mecanica del SG90.
constexpr uint8_t SERVO_PIN = 27;  // D4 / IO27 en la DFR0478
constexpr int SERVO_CENTRO_GRADOS = 90;
constexpr int SERVO_RECORRIDO_MAXIMO_GRADOS = 40;

// Limita las lecturas laterales muy grandes o sin eco. Esto evita que un
// valor 0xFFFF produzca un giro descontrolado.
constexpr uint16_t DISTANCIA_LATERAL_MAXIMA_MM = 1500;

// Reduccion preventiva por pared lateral. Solo se activa si un lado esta
// cerca Y existe suficiente diferencia con el lado opuesto. Por eso no
// reduce la velocidad cuando ambos lados estan cerca en un pasillo angosto.
// La transicion es gradual entre los umbrales de inicio y maximo.
constexpr uint16_t PARED_LATERAL_CERCA_INICIO_MM = 250;
constexpr uint16_t PARED_LATERAL_CERCA_MAXIMA_MM = 100;
constexpr uint16_t DIFERENCIA_LATERAL_INICIO_MM = 150;
constexpr uint16_t DIFERENCIA_LATERAL_MAXIMA_MM = 350;

// Comportamiento al acercarse a una pared o esquina de frente.
// Entre INICIO y CRITICA se aumenta Kp y se reduce la velocidad gradualmente.
// La cercania a una pared lateral usa el mismo multiplicador de Kp.
constexpr uint16_t DISTANCIA_FRENTE_INICIO_MM = 1000;
constexpr uint16_t DISTANCIA_FRENTE_CRITICA_MM = 300;

// Escape frontal: frena, centra el servo y retrocede hasta recuperar espacio.
constexpr uint16_t DISTANCIA_FRENTE_RETROCESO_MM = 300;
constexpr uint16_t DISTANCIA_FRENTE_SALIDA_RETROCESO_MM = 450;
constexpr unsigned long DURACION_FRENO_ANTES_RETROCESO_MS = 150;
constexpr unsigned long DURACION_MAXIMA_RETROCESO_MS = 2500;
constexpr float MULTIPLICADOR_KP_EN_ESQUINA = 1.5f;   ////////////////////////////////////////////////////////////////
constexpr uint8_t BRILLO_LED_EN_ESQUINA_PORCENTAJE = 20;

// Pulsos habituales para un SG90. Como el movimiento queda limitado a
// 55..135 grados, el servo trabaja lejos de sus topes electricos.
constexpr uint16_t SERVO_PULSO_MINIMO_US = 500;
constexpr uint16_t SERVO_PULSO_MAXIMO_US = 2500;

// ====================================================================
//                    FIN DE VARIABLES DE CALIBRACION
// ====================================================================

// ------------------------ Configuracion general ----------------------

constexpr uint8_t NANO_I2C_ADDRESS = 0x08;
constexpr uint8_t SENSOR_COUNT = 5;
constexpr uint8_t DISTANCE_PACKET_BYTES = SENSOR_COUNT * 2;
constexpr uint16_t INVALID_DISTANCE_MM = 0xFFFF;
constexpr uint16_t DISTANCIA_SIN_ECO_MM = 2000;

// Pines I2C de la DFRobot FireBeetle ESP32 DFR0478.
// En la placa estan rotulados como SDA/IO21 y SCL/IO22.
constexpr uint8_t ESP32_SDA_PIN = 21;
constexpr uint8_t ESP32_SCL_PIN = 22;
constexpr uint32_t I2C_FREQUENCY_HZ = 100000;

// El ESP32 consulta a 50 Hz para usar cada lectura nueva del Nano con poca
// latencia. La impresion se limita para que Serial no frene el control.
constexpr unsigned long SENSOR_POLL_INTERVAL_MS = 20;
constexpr unsigned long SERIAL_PRINT_INTERVAL_MS = 500;

// Limite de trabajo auxiliar por ciclo. No cambia el control ni sus
// calibraciones; evita que una rafaga serial monopolice loop().
constexpr uint8_t MAX_SERIAL_BYTES_PER_LOOP = 16;
constexpr uint16_t I2C_TRANSACTION_TIMEOUT_MS = 50;

constexpr uint32_t SERVO_PWM_FREQUENCY_HZ = 50;
constexpr uint8_t SERVO_PWM_RESOLUTION_BITS = 16;

// PWM inaudible para el motor DC. Diez bits dan un rango de 0 a 1023.
constexpr uint32_t MOTOR_PWM_FREQUENCY_HZ = 20000;
constexpr uint8_t MOTOR_PWM_RESOLUTION_BITS = 10;

// Si se pierde la comunicacion con los sensores, el motor se detiene.
constexpr unsigned long SENSOR_FAILSAFE_TIMEOUT_MS = 250;

#if ESP_ARDUINO_VERSION_MAJOR < 3
constexpr uint8_t SERVO_PWM_CHANNEL = 0;
constexpr uint8_t MOTOR_PWM_CHANNEL = 1;
#endif

static_assert(DIRECCION_SERVO == 1 || DIRECCION_SERVO == -1,
              "DIRECCION_SERVO debe ser 1 o -1");
static_assert(DISTANCIA_FRENTE_INICIO_MM > DISTANCIA_FRENTE_CRITICA_MM,
              "La distancia de inicio debe ser mayor que la critica");
static_assert(DISTANCIA_FRENTE_SALIDA_RETROCESO_MM >
                  DISTANCIA_FRENTE_RETROCESO_MM,
              "La salida del retroceso debe superar su distancia de entrada");
static_assert(DISTANCIA_FRENTE_RETROCESO_MM >=
                  DISTANCIA_FRENTE_CRITICA_MM,
              "El escape debe activarse antes o al llegar a distancia critica");
static_assert(DURACION_FRENO_ANTES_RETROCESO_MS > 0,
              "La duracion del freno debe ser mayor que cero");
static_assert(DURACION_MAXIMA_RETROCESO_MS > 0,
              "La duracion maxima de retroceso debe ser mayor que cero");
static_assert(VELOCIDAD_MOTOR_PORCENTAJE >=
                  VELOCIDAD_MOTOR_EN_ESQUINA_PORCENTAJE,
              "La velocidad normal debe ser mayor o igual que la minima");
static_assert(VELOCIDAD_MOTOR_PORCENTAJE >=
                  VELOCIDAD_MINIMA_PARED_LATERAL_PORCENTAJE,
              "La velocidad lateral minima no puede superar la normal");
static_assert(PARED_LATERAL_CERCA_INICIO_MM >
                  PARED_LATERAL_CERCA_MAXIMA_MM,
              "El rango de cercania lateral debe ser descendente");
static_assert(DIFERENCIA_LATERAL_MAXIMA_MM >
                  DIFERENCIA_LATERAL_INICIO_MM,
              "El rango de diferencia lateral debe ser ascendente");
static_assert(VELOCIDAD_DETECCION_ARRANQUE_PORCENTAJE > 0,
              "La velocidad de deteccion debe ser mayor que cero");
static_assert(VELOCIDAD_DETECCION_ARRANQUE_PORCENTAJE <=
                  VELOCIDAD_MOTOR_EN_ESQUINA_PORCENTAJE,
              "La velocidad de deteccion no debe superar la minima");
static_assert(VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE > 0 &&
                  VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE <= 100,
              "La velocidad de retroceso debe estar entre 1 y 100");
static_assert(PULSOS_ENCODER_PARA_ARRANCAR > 0,
              "Se necesita al menos un pulso para detectar movimiento");
static_assert(MUESTRAS_PARA_CLASIFICAR_PASILLO > 0,
              "Se necesita al menos una muestra para clasificar el pasillo");
static_assert(DURACION_AVANCE_FINAL_PASILLO_ANCHO_MS > 0 &&
                  DURACION_AVANCE_FINAL_PASILLO_ANGOSTO_MS > 0,
              "Los avances finales deben durar mas de cero");
static_assert(GRADOS_POR_ESQUINA > 0.0f &&
                  ANTICIPACION_SEGURO_90_GRADOS > 0.0f &&
                  ANTICIPACION_SEGURO_90_GRADOS < GRADOS_POR_ESQUINA,
              "La anticipacion del seguro de 90 grados no es valida");
static_assert(VELOCIDAD_SEGURO_90_PORCENTAJE > 0 &&
                  VELOCIDAD_SEGURO_90_PORCENTAJE <= 100,
              "La velocidad del seguro debe estar entre 1 y 100");
static_assert(DURACION_SERVO_CENTRADO_90_MS > 0 &&
                  DURACION_REENTRADA_PID_90_MS > 0,
              "Los tiempos de centrado de esquina deben ser mayores que cero");
static_assert(PASO_MAXIMO_SERVO_POR_LECTURA_GRADOS > 0 &&
                  PASO_MAXIMO_SERVO_POR_LECTURA_GRADOS <=
                      SERVO_RECORRIDO_MAXIMO_GRADOS,
              "El paso maximo del servo debe ser valido");
static_assert(VELOCIDAD_AJUSTE_FINAL_PORCENTAJE > 0 &&
                  VELOCIDAD_AJUSTE_FINAL_PORCENTAJE <= 100,
              "La velocidad de ajuste final debe estar entre 1 y 100");
static_assert(DISTANCIA_SALIDA_AJUSTE_FINAL_MM >
                  DISTANCIA_INICIO_AJUSTE_FINAL_MM,
              "La salida del ajuste final debe superar su inicio");
static_assert(DURACION_FRENO_AJUSTE_FINAL_MS > 0 &&
                  DURACION_MAXIMA_AJUSTE_FINAL_MS > 0,
              "Los tiempos del ajuste final deben ser mayores que cero");
static_assert(DIRECCION_SERVO_AJUSTE_FINAL == 1 ||
                  DIRECCION_SERVO_AJUSTE_FINAL == -1,
              "La direccion del servo de ajuste debe ser 1 o -1");
static_assert(KP >= 0.0f && KI >= 0.0f && KD >= 0.0f,
              "KP, KI y KD no pueden ser negativos");
static_assert(MULTIPLICADOR_KP_INICIAL > 0.0f &&
                  MULTIPLICADOR_KP_INICIAL <= 1.0f,
              "El multiplicador de Kp inicial debe estar entre 0 y 1");
static_assert(BRILLO_LED_EN_ESQUINA_PORCENTAJE <= 100,
              "El brillo LED de esquina no puede superar 100");
static_assert(FILTRO_DERIVADA >= 0.0f && FILTRO_DERIVADA <= 1.0f,
              "FILTRO_DERIVADA debe estar entre 0 y 1");

bool servoPwmReady = false;
bool motorPwmReady = false;
bool servoPwmValueWritten = false;
uint8_t velocidadObjetivoPorcentaje = 0;
uint8_t velocidadAplicadaPorcentaje = 0;
uint8_t brilloLedBasePorcentaje = 0;
bool ledsIndicandoEsquina = false;
bool retrocesoEscapeActivo = false;
bool retrocesoEscapeFrenando = false;
bool retrocesoEscapeLimiteAlcanzado = false;
unsigned long retrocesoEscapeStartMs = 0;
bool distanceSensorFailsafeActive = false;
int currentServoAngle = SERVO_CENTRO_GRADOS;
float latestCornerFactor = 0.0f;
float latestLateralWallFactor = 0.0f;
uint16_t latestDistancesMm[SENSOR_COUNT] = {
    INVALID_DISTANCE_MM,
    INVALID_DISTANCE_MM,
    INVALID_DISTANCE_MM,
    INVALID_DISTANCE_MM,
    INVALID_DISTANCE_MM
};
