daiilvvyeyo/WRO-2026-Future-Engineers-Superiores/codes/ESP32_Open_Optimizado.ino
  velocidadObjetivoPorcentaje = VELOCIDAD_AJUSTE_FINAL_PORCENTAJE;
  setMotorDirectionReverse();
  applyMotorPwmPercent(VELOCIDAD_AJUSTE_FINAL_PORCENTAJE);

}

void updateFinalAdvance(unsigned long nowMs) {
  if (!finalAdvanceActive || missionComplete) {
    return;
  }

  const unsigned long elapsedMs = nowMs - finalAdvanceLastUpdateMs;
  finalAdvanceLastUpdateMs = nowMs;

  // Conserva PID y protecciones. Solo cuenta tiempo con orden de avance y
  // PWM aplicado; una frenada, un retroceso o un failsafe pausa el avance.
  const bool movingForward =
      !retrocesoEscapeActivo &&
      velocidadObjetivoPorcentaje > 0 &&
      velocidadAplicadaPorcentaje > 0;

  if (movingForward) {
    finalAdvanceAccumulatedMs += elapsedMs;
  }

  if (finalAdvanceAccumulatedMs >= selectedFinalAdvanceDurationMs) {
    startFinalReverseIfNeeded(nowMs);
  }
}

unsigned long roundElapsedMs() {
  if (!roundTimerStarted) {
    return 0;
  }

  const unsigned long endMs =
      missionComplete ? roundFinishMs : millis();
  return endMs - roundStartMs;
}

void processBno085Heading(float yawDegrees, unsigned long nowMs) {
  currentYawDegrees = yawDegrees;
  lastBno085FrameMs = nowMs;
  bno085FailsafeActive = false;

  if (!bno085HasHeading) {
    bno085HasHeading = true;
    previousYawDegrees = yawDegrees;
    Serial.println("BNO085 listo: rumbo recibido por I2C.");
    return;
  }

  const float headingDelta =
      normalizeHeadingDelta(yawDegrees - previousYawDegrees);
  previousYawDegrees = yawDegrees;

  if (missionComplete || finalAdvanceActive) {
    return;
  }

  if (finalReverseActive) {
    if (fabsf(headingDelta) <= CAMBIO_RUMBO_MAXIMO_GRADOS) {
      accumulatedTurnDegrees += headingDelta;
    }
    return;
  }

  // La referencia de la primera vuelta se fija cuando el encoder confirma
  // movimiento. Asi, girar el robot a mano antes de arrancar no suma vueltas.
  if (!lapTrackingActive &&
      motorStartupState != MotorStartupState::WAITING_FOR_MOVEMENT) {
    lapTrackingActive = true;
    accumulatedTurnDegrees = 0.0f;
    completedLaps = 0;
    quarterTurnGuardHolding = false;
    nextQuarterTurnGuard = 1;
    quarterTurnGuardStartMs = 0;
    quarterTurnGuardReleaseStartMs = 0;
    Serial.println("Conteo de 3 vueltas iniciado.");
    return;
  }

  if (!lapTrackingActive) {
    return;
  }

  if (fabsf(headingDelta) > CAMBIO_RUMBO_MAXIMO_GRADOS) {
    Serial.println("BNO085: salto de rumbo descartado.");
    return;
  }

  accumulatedTurnDegrees += headingDelta;

  const uint8_t newCompletedLaps = static_cast<uint8_t>(
      floorf(fabsf(accumulatedTurnDegrees) / GRADOS_POR_VUELTA)
  );

  if (newCompletedLaps > completedLaps) {
    completedLaps = min(newCompletedLaps, VUELTAS_OBJETIVO);
    Serial.print("Vuelta completada: ");
    Serial.print(completedLaps);
    Serial.print("/");
    Serial.println(VUELTAS_OBJETIVO);
  }

  if (fabsf(accumulatedTurnDegrees) >=
      GRADOS_POR_VUELTA * VUELTAS_OBJETIVO) {
    startFinalAdvance(nowMs);
  }
}

void updateBno085(unsigned long nowMs) {
  if (!bno085Initialized) {
    return;
  }

  if (bno085.wasReset()) {
    bno085HasHeading = false;
    if (!bno085.enableReport(
            SH2_GAME_ROTATION_VECTOR,
            BNO085_REPORT_INTERVAL_US
        )) {
      bno085Initialized = false;
      Serial.println("ERROR: no se pudo reactivar el reporte del BNO085.");
      return;
    }

    Serial.println("BNO085 reiniciado: reporte de orientacion restaurado.");
  }

  while (bno085.getSensorEvent(&bno085SensorValue)) {
    if (bno085SensorValue.sensorId != SH2_GAME_ROTATION_VECTOR) {
      continue;
    }

    const float qr = bno085SensorValue.un.gameRotationVector.real;
    const float qi = bno085SensorValue.un.gameRotationVector.i;
    const float qj = bno085SensorValue.un.gameRotationVector.j;
    const float qk = bno085SensorValue.un.gameRotationVector.k;
    const float sqr = qr * qr;
    const float sqi = qi * qi;
    const float sqj = qj * qj;
    const float sqk = qk * qk;
    const float yawDegrees = atan2f(
        2.0f * (qi * qj + qk * qr),
        sqi - sqj - sqk + sqr
    ) * RAD_TO_DEG;

    processBno085Heading(yawDegrees, nowMs);
  }
}

bool tryBeginBno085AtAddress(uint8_t address) {
  if (!bno085.begin_I2C(address, &Wire)) {
    return false;
  }

  if (!bno085.enableReport(
          SH2_GAME_ROTATION_VECTOR,
          BNO085_REPORT_INTERVAL_US
      )) {
    Serial.print("BNO085 encontrado en 0x");
    Serial.print(address, HEX);
    Serial.println(", pero no acepto el reporte de orientacion.");
    return false;
  }

  bno085I2cAddressDetected = address;
  bno085Initialized = true;
  lastBno085FrameMs = millis();

  Serial.print("BNO085 I2C listo en direccion 0x");
  Serial.println(address, HEX);
  return true;
}

void beginBno085I2c() {
  if (tryBeginBno085AtAddress(BNO085_I2C_ADDRESS_PRIMARY)) {
    return;
  }

  if (tryBeginBno085AtAddress(BNO085_I2C_ADDRESS_SECONDARY)) {
    return;
  }

  Serial.println(
      "AVISO: BNO085 no detectado en I2C 0x4B ni 0x4A."
  );
}

// ----------------------- Deteccion del encoder ----------------------

void IRAM_ATTR handleEncoderAPulse() {
  // Un uint32_t alineado se lee/escribe atomicamente en el ESP32. Para el
  // arranque solo interesa la cantidad de movimiento, no la direccion.
  ++encoderPulseCount;
}

uint32_t readEncoderPulseCount() {
  return encoderPulseCount;
}

void beginEncoder() {
  pinMode(ENCODER_A_PIN, INPUT);
  pinMode(ENCODER_B_PIN, INPUT);
  encoderDetectionBaseline = readEncoderPulseCount();
  attachInterrupt(
      digitalPinToInterrupt(ENCODER_A_PIN),
      handleEncoderAPulse,
      RISING
  );
}

void resetMotorStartupDetection() {
  motorStartupState = MotorStartupState::WAITING_FOR_MOVEMENT;
  encoderDetectionBaseline = readEncoderPulseCount();
  encoderDetectionWindowStartMs = 0;
  motorRampStartMs = 0;
  encoderDetectionWindowActive = false;
}

// ------------------------ Control del servo SG90 ---------------------

bool beginServoPwm() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  return ledcAttach(
      SERVO_PIN,
      SERVO_PWM_FREQUENCY_HZ,
      SERVO_PWM_RESOLUTION_BITS
  );
#else
  ledcSetup(
      SERVO_PWM_CHANNEL,
      SERVO_PWM_FREQUENCY_HZ,
      SERVO_PWM_RESOLUTION_BITS
  );
  ledcAttachPin(SERVO_PIN, SERVO_PWM_CHANNEL);
  return true;
#endif
}

