daiilvvyeyo/WRO-2026-Future-Engineers-Superiores/codes/ESP32_Open_Optimizado.ino
void writeServoAngle(int angleDegrees) {
  if (!servoPwmReady) {
    return;
  }

  angleDegrees = constrain(angleDegrees, 0, 180);

  // El control puede solicitar el mismo angulo miles de veces por segundo
  // durante un retroceso. La senal PWM ya permanece activa por hardware.
  if (servoPwmValueWritten && angleDegrees == currentServoAngle) {
    return;
  }
  currentServoAngle = angleDegrees;

  const uint32_t pulseUs =
      SERVO_PULSO_MINIMO_US +
      (
          static_cast<uint32_t>(angleDegrees) *
          (SERVO_PULSO_MAXIMO_US - SERVO_PULSO_MINIMO_US)
      ) /
          180UL;

  constexpr uint32_t PWM_PERIOD_US =
      1000000UL / SERVO_PWM_FREQUENCY_HZ;
  constexpr uint32_t PWM_MAX_DUTY =
      (1UL << SERVO_PWM_RESOLUTION_BITS) - 1UL;

  const uint32_t duty =
      (pulseUs * PWM_MAX_DUTY + PWM_PERIOD_US / 2UL) /
      PWM_PERIOD_US;

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(SERVO_PIN, duty);
#else
  ledcWrite(SERVO_PWM_CHANNEL, duty);
#endif
  servoPwmValueWritten = true;
}

// ---------------------- Control del motor TB6612 --------------------

void setMotorDirectionForward() {
  digitalWrite(
      MOTOR_AIN1_PIN,
      INVERTIR_DIRECCION_MOTOR ? LOW : HIGH
  );
  digitalWrite(
      MOTOR_AIN2_PIN,
      INVERTIR_DIRECCION_MOTOR ? HIGH : LOW
  );
}

void setMotorDirectionReverse() {
  digitalWrite(
      MOTOR_AIN1_PIN,
      INVERTIR_DIRECCION_MOTOR ? HIGH : LOW
  );
  digitalWrite(
      MOTOR_AIN2_PIN,
      INVERTIR_DIRECCION_MOTOR ? LOW : HIGH
  );
}

void writeMotorPwmPercent(uint8_t percent) {
  if (!motorPwmReady) {
    return;
  }

  percent = constrain(percent, 0, 100);

  constexpr uint32_t MOTOR_PWM_MAX_DUTY =
      (1UL << MOTOR_PWM_RESOLUTION_BITS) - 1UL;
  const uint32_t duty =
      (static_cast<uint32_t>(percent) * MOTOR_PWM_MAX_DUTY + 50UL) /
      100UL;

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(MOTOR_PWM_PIN, duty);
#else
  ledcWrite(MOTOR_PWM_CHANNEL, duty);
#endif
}

void applyMotorPwmPercent(uint8_t percent) {
  percent = constrain(percent, 0, 100);

  if (!motorPwmReady || percent == velocidadAplicadaPorcentaje) {
    return;
  }

  writeMotorPwmPercent(percent);
  velocidadAplicadaPorcentaje = percent;
}

void stopMotor() {
  writeMotorPwmPercent(0);
  digitalWrite(MOTOR_AIN1_PIN, LOW);
  digitalWrite(MOTOR_AIN2_PIN, LOW);
  velocidadObjetivoPorcentaje = 0;
  velocidadAplicadaPorcentaje = 0;
  retrocesoEscapeActivo = false;
  retrocesoEscapeFrenando = false;
  retrocesoEscapeLimiteAlcanzado = false;
  retrocesoEscapeStartMs = 0;
  resetMotorStartupDetection();
  resetPidControl();
}

bool beginMotorPwm() {
  pinMode(MOTOR_AIN1_PIN, OUTPUT);
  pinMode(MOTOR_AIN2_PIN, OUTPUT);
  digitalWrite(MOTOR_AIN1_PIN, LOW);
  digitalWrite(MOTOR_AIN2_PIN, LOW);

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  return ledcAttach(
      MOTOR_PWM_PIN,
      MOTOR_PWM_FREQUENCY_HZ,
      MOTOR_PWM_RESOLUTION_BITS
  );
#else
  ledcSetup(
      MOTOR_PWM_CHANNEL,
      MOTOR_PWM_FREQUENCY_HZ,
      MOTOR_PWM_RESOLUTION_BITS
  );
  ledcAttachPin(MOTOR_PWM_PIN, MOTOR_PWM_CHANNEL);
  return true;
#endif
}

// --------------------------- Control PID ----------------------------

float lateralDistanceForControl(uint16_t rawDistanceMm) {
  if (rawDistanceMm == INVALID_DISTANCE_MM ||
      rawDistanceMm > DISTANCIA_LATERAL_MAXIMA_MM) {
    return static_cast<float>(DISTANCIA_LATERAL_MAXIMA_MM);
  }

  return static_cast<float>(rawDistanceMm);
}

float calculateCornerFactor(uint16_t frontDistanceMm) {
  if (frontDistanceMm == INVALID_DISTANCE_MM ||
      frontDistanceMm >= DISTANCIA_FRENTE_INICIO_MM) {
    return 0.0f;
  }

  if (frontDistanceMm <= DISTANCIA_FRENTE_CRITICA_MM) {
    return 1.0f;
  }

  return static_cast<float>(
             DISTANCIA_FRENTE_INICIO_MM - frontDistanceMm
         ) /
         static_cast<float>(
             DISTANCIA_FRENTE_INICIO_MM -
             DISTANCIA_FRENTE_CRITICA_MM
         );
}

float calculateLateralWallFactor(
    float s1,
    float s2,
    float s4,
    float s5
) {
  // La lectura mas cercana de cada lado protege tambien cuando el robot
  // entra inclinado y solo uno de los dos sensores se aproxima a la pared.
  const float closestLeftMm = fminf(s1, s2);
  const float closestRightMm = fminf(s4, s5);
  const float closestSideMm = fminf(closestLeftMm, closestRightMm);
  const float oppositeSideMm = fmaxf(closestLeftMm, closestRightMm);
  const float sideDifferenceMm = oppositeSideMm - closestSideMm;

  if (closestSideMm >= PARED_LATERAL_CERCA_INICIO_MM ||
      sideDifferenceMm <= DIFERENCIA_LATERAL_INICIO_MM) {
    return 0.0f;
  }

  const float proximityFactor = constrain(
      (PARED_LATERAL_CERCA_INICIO_MM - closestSideMm) /
          static_cast<float>(
              PARED_LATERAL_CERCA_INICIO_MM -
              PARED_LATERAL_CERCA_MAXIMA_MM
          ),
      0.0f,
      1.0f
  );
  const float differenceFactor = constrain(
      (sideDifferenceMm - DIFERENCIA_LATERAL_INICIO_MM) /
          static_cast<float>(
              DIFERENCIA_LATERAL_MAXIMA_MM -
              DIFERENCIA_LATERAL_INICIO_MM
          ),
      0.0f,
      1.0f
  );

  // Ambos requisitos deben ser fuertes para aplicar la reduccion completa.
  return fminf(proximityFactor, differenceFactor);
}

float calculateStartupKpFactor(unsigned long nowMs) {
  if (motorStartupState == MotorStartupState::WAITING_FOR_MOVEMENT) {
    return MULTIPLICADOR_KP_INICIAL;
  }

  if (motorStartupState == MotorStartupState::RAMPING) {
    const unsigned long elapsedMs = nowMs - motorRampStartMs;

    if (elapsedMs >= DURACION_ARRANQUE_SUAVE_MS) {
      return 1.0f;
    }

    const float rampProgress =
        static_cast<float>(elapsedMs) /
        static_cast<float>(DURACION_ARRANQUE_SUAVE_MS);

    return MULTIPLICADOR_KP_INICIAL +
           (1.0f - MULTIPLICADOR_KP_INICIAL) * rampProgress;
  }

  return 1.0f;
}

void setMotorSpeedPercent(uint8_t percent) {
  velocidadObjetivoPorcentaje = constrain(percent, 0, 100);

  if (velocidadObjetivoPorcentaje == 0) {
    stopMotor();
    return;
  }

  setMotorDirectionForward();
}

void updateMotorSoftStart(unsigned long nowMs) {
  if (retrocesoEscapeActivo || !motorPwmReady ||
      velocidadObjetivoPorcentaje == 0) {
    return;
  }

  setMotorDirectionForward();

