daiilvvyeyo/WRO-2026-Future-Engineers-Superiores/codes/ESP32_Open_Optimizado.ino
  if (motorStartupState == MotorStartupState::WAITING_FOR_MOVEMENT) {
    applyMotorPwmPercent(VELOCIDAD_DETECCION_ARRANQUE_PORCENTAJE);

    const uint32_t currentPulseCount = readEncoderPulseCount();
    const uint32_t detectedPulses =
        currentPulseCount - encoderDetectionBaseline;

    if (detectedPulses > 0 && !encoderDetectionWindowActive) {
      encoderDetectionWindowActive = true;
      encoderDetectionWindowStartMs = nowMs;
    }

    if (encoderDetectionWindowActive &&
        detectedPulses >= PULSOS_ENCODER_PARA_ARRANCAR) {
      motorStartupState = MotorStartupState::RAMPING;
      motorRampStartMs = nowMs;

      if (!roundTimerStarted) {
        roundTimerStarted = true;
        roundStartMs = nowMs;
        roundFinishMs = 0;
        Serial.println("Cronometro de ronda iniciado.");
      }

      Serial.println(
          "Movimiento de motor detectado: inicia rampa suave."
      );
      return;
    }

    if (encoderDetectionWindowActive &&
        nowMs - encoderDetectionWindowStartMs >=
            VENTANA_DETECCION_MOVIMIENTO_MS) {
      // Pulsos aislados no deben armar el arranque. Se abre una ventana nueva.
      encoderDetectionBaseline = currentPulseCount;
      encoderDetectionWindowActive = false;
    }

    return;
  }

  if (motorStartupState == MotorStartupState::RAMPING) {
    const unsigned long elapsedMs = nowMs - motorRampStartMs;

    if (elapsedMs >= DURACION_ARRANQUE_SUAVE_MS) {
      motorStartupState = MotorStartupState::RUNNING;
      applyMotorPwmPercent(velocidadObjetivoPorcentaje);
      Serial.println("Rampa suave terminada.");
      return;
    }

    const int16_t speedRange =
        static_cast<int16_t>(velocidadObjetivoPorcentaje) -
        static_cast<int16_t>(
            VELOCIDAD_DETECCION_ARRANQUE_PORCENTAJE
        );
    const int16_t rampSpeed =
        static_cast<int16_t>(
            VELOCIDAD_DETECCION_ARRANQUE_PORCENTAJE
        ) +
        static_cast<int32_t>(speedRange) * elapsedMs /
            DURACION_ARRANQUE_SUAVE_MS;

    applyMotorPwmPercent(static_cast<uint8_t>(rampSpeed));
    return;
  }

  applyMotorPwmPercent(velocidadObjetivoPorcentaje);
}

int getReverseAlignmentServoAngle() {
  // Si todavia no hay suficiente giro acumulado, no inventamos una
  // direccion: mantenemos el servo centrado.
  if (!lapTrackingActive ||
      fabsf(accumulatedTurnDegrees) < UMBRAL_SENTIDO_RETROCESO_GRADOS) {
    return SERVO_CENTRO_GRADOS;
  }

  // El signo del giro acumulado define el sentido de la ronda.
  const int8_t roundYawSign =
      accumulatedTurnDegrees > 0.0f ? 1 : -1;

  const int correction =
      roundYawSign *
      DIRECCION_SERVO_REVERSA *
      ANGULO_GUIA_RETROCESO_GRADOS;

  return constrain(
      SERVO_CENTRO_GRADOS + correction,
      SERVO_CENTRO_GRADOS - SERVO_RECORRIDO_MAXIMO_GRADOS,
      SERVO_CENTRO_GRADOS + SERVO_RECORRIDO_MAXIMO_GRADOS
  );
}

bool updateReverseEscape(
    uint16_t frontDistanceMm,
    unsigned long nowMs
) {
  const bool validFrontDistance =
      frontDistanceMm != INVALID_DISTANCE_MM;

  if (!retrocesoEscapeActivo && validFrontDistance &&
      frontDistanceMm <= DISTANCIA_FRENTE_RETROCESO_MM) {
    // Corta el PWM antes de invertir el puente H.
    writeMotorPwmPercent(0);
    velocidadAplicadaPorcentaje = 0;
    digitalWrite(MOTOR_AIN1_PIN, LOW);
    digitalWrite(MOTOR_AIN2_PIN, LOW);

    retrocesoEscapeActivo = true;
    retrocesoEscapeFrenando = true;
    retrocesoEscapeLimiteAlcanzado = false;
    retrocesoEscapeStartMs = nowMs;
    velocidadObjetivoPorcentaje = 0;
    resetPidControl();

    writeServoAngle(getReverseAlignmentServoAngle());

    Serial.print("Obstaculo a menos de ");
    Serial.print(DISTANCIA_FRENTE_RETROCESO_MM / 10);
    Serial.println(" cm: inicia frenado antes del retroceso.");
  }

  const bool frontClear =
      validFrontDistance &&
      frontDistanceMm >= DISTANCIA_FRENTE_SALIDA_RETROCESO_MM;
  const bool reverseTimeout =
      retrocesoEscapeActivo && !frontClear &&
      !retrocesoEscapeFrenando &&
      !retrocesoEscapeLimiteAlcanzado &&
      nowMs - retrocesoEscapeStartMs >= DURACION_MAXIMA_RETROCESO_MS;

  if (retrocesoEscapeActivo && frontClear) {
    // Detiene el motor antes de recuperar el sentido hacia adelante.
    writeMotorPwmPercent(0);
    velocidadAplicadaPorcentaje = 0;
    velocidadObjetivoPorcentaje = 0;
    retrocesoEscapeActivo = false;
    retrocesoEscapeFrenando = false;
    retrocesoEscapeLimiteAlcanzado = false;
    retrocesoEscapeStartMs = 0;

    setMotorDirectionForward();
    resetMotorStartupDetection();
    resetPidControl();

    Serial.println(
        "Espacio frontal liberado: termina el retroceso de escape."
    );
  }

  if (retrocesoEscapeActivo && retrocesoEscapeFrenando &&
      nowMs - retrocesoEscapeStartMs >=
          DURACION_FRENO_ANTES_RETROCESO_MS) {
    retrocesoEscapeFrenando = false;
    retrocesoEscapeStartMs = nowMs;
    velocidadObjetivoPorcentaje =
        VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE;

    setMotorDirectionReverse();
    applyMotorPwmPercent(VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE);

    Serial.print("Inicia retroceso al ");
    Serial.print(VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE);
    Serial.print("%, guiando al sentido de la ronda. Servo=");
    Serial.println(getReverseAlignmentServoAngle());
  }

  if (reverseTimeout) {
    writeMotorPwmPercent(0);
    velocidadAplicadaPorcentaje = 0;
    velocidadObjetivoPorcentaje = 0;
    retrocesoEscapeLimiteAlcanzado = true;

    Serial.println(
        "Tiempo maximo de retroceso alcanzado: motor detenido."
    );
  }

  if (retrocesoEscapeActivo) {
    writeServoAngle(getReverseAlignmentServoAngle());

    if (!retrocesoEscapeFrenando &&
        !retrocesoEscapeLimiteAlcanzado) {
      setMotorDirectionReverse();
      applyMotorPwmPercent(VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE);
    }
  }

  return retrocesoEscapeActivo;
}

void applyQuarterTurnGuard(
    unsigned long nowMs,
    int &servoAngle,
    uint8_t &speedPercent
) {
  if (!SEGURO_CADA_90_HABILITADO || !lapTrackingActive ||
      !bno085HasHeading || bno085FailsafeActive || missionComplete ||
      retrocesoEscapeActivo || finalReverseActive) {
    return;
  }

  const float absoluteTurnDegrees = fabsf(accumulatedTurnDegrees);
  const float targetDegrees =
      static_cast<float>(nextQuarterTurnGuard) * GRADOS_POR_ESQUINA;

  if (quarterTurnGuardHolding) {
    servoAngle = SERVO_CENTRO_GRADOS;
    speedPercent = min(
        speedPercent,
        VELOCIDAD_SEGURO_90_PORCENTAJE
    );

    if (nowMs - quarterTurnGuardStartMs >=
        DURACION_SERVO_CENTRADO_90_MS) {
      quarterTurnGuardHolding = false;
      quarterTurnGuardStartMs = 0;
      quarterTurnGuardReleaseStartMs = nowMs;
      resetPidControl();
      if (nextQuarterTurnGuard < VUELTAS_OBJETIVO * 4) {
        ++nextQuarterTurnGuard;
      }
      Serial.println("Seguro de 90 terminado: regresa el control PID.");
    }
    return;
  }

  if (absoluteTurnDegrees >= targetDegrees) {
    quarterTurnGuardHolding = true;
    quarterTurnGuardStartMs = nowMs;
    quarterTurnGuardReleaseStartMs = 0;
    resetPidControl();
    servoAngle = SERVO_CENTRO_GRADOS;
    speedPercent = min(
        speedPercent,
        VELOCIDAD_SEGURO_90_PORCENTAJE
    );

    Serial.print("Seguro de 90 activado en ");
    Serial.print(accumulatedTurnDegrees, 1);
    Serial.println(" grados: servo centrado.");
    return;
  }

  if (quarterTurnGuardReleaseStartMs != 0) {
    const unsigned long releaseElapsedMs =
        nowMs - quarterTurnGuardReleaseStartMs;

    if (releaseElapsedMs >= DURACION_REENTRADA_PID_90_MS) {
      quarterTurnGuardReleaseStartMs = 0;
    } else {
      const float releaseProgress =
          static_cast<float>(releaseElapsedMs) /
          static_cast<float>(DURACION_REENTRADA_PID_90_MS);
      const int requestedCorrection = servoAngle - SERVO_CENTRO_GRADOS;
      servoAngle = SERVO_CENTRO_GRADOS + static_cast<int>(roundf(
          requestedCorrection * releaseProgress
      ));
      speedPercent = min(
          speedPercent,
          VELOCIDAD_MOTOR_EN_ESQUINA_PORCENTAJE
      );
    }
  }

  const float remainingDegrees = targetDegrees - absoluteTurnDegrees;
  if (remainingDegrees <= ANTICIPACION_SEGURO_90_GRADOS) {
    servoAngle = constrain(
        servoAngle,
        SERVO_CENTRO_GRADOS - CORRECCION_MAXIMA_PREVIA_90_GRADOS,
        SERVO_CENTRO_GRADOS + CORRECCION_MAXIMA_PREVIA_90_GRADOS
    );
    speedPercent = min(
        speedPercent,
        VELOCIDAD_SEGURO_90_PORCENTAJE
    );
  }
}

ControlState updatePidControl(
    const uint16_t distancesMm[SENSOR_COUNT],
    unsigned long nowMs
) {
  const float s1 = lateralDistanceForControl(distancesMm[0]);
  const float s2 = lateralDistanceForControl(distancesMm[1]);
  const float s4 = lateralDistanceForControl(distancesMm[3]);
  const float s5 = lateralDistanceForControl(distancesMm[4]);

  ControlState state;
  state.leftValue = s1 * PESO_S1 + s2 * PESO_S2;
  state.rightValue = s4 * PESO_S4 + s5 * PESO_S5;
  state.error = state.leftValue - state.rightValue;

  state.cornerFactor = calculateCornerFactor(distancesMm[2]);
  latestCornerFactor = state.cornerFactor;
  state.lateralWallFactor = calculateLateralWallFactor(s1, s2, s4, s5);
  latestLateralWallFactor = state.lateralWallFactor;
  state.startupKpFactor = calculateStartupKpFactor(nowMs);
  const float wallProximityFactor =
      fmaxf(state.cornerFactor, state.lateralWallFactor);
  state.effectiveKp =
      KP *
      (
          1.0f +
          wallProximityFactor *
              (MULTIPLICADOR_KP_EN_ESQUINA - 1.0f)
      ) *
      state.startupKpFactor;

  const unsigned long nowUs = micros();
  float derivative = 0.0f;

  if (pidHasPreviousSample) {
    const float dtSeconds =
        static_cast<float>(nowUs - pidPreviousUpdateUs) / 1000000.0f;

    if (dtSeconds > 0.0f && dtSeconds <= 0.25f) {
      pidIntegralError += state.error * dtSeconds;

      if (KI > 0.0f) {
        const float integralLimitError = LIMITE_INTEGRAL_GRADOS / KI;
        pidIntegralError = constrain(
            pidIntegralError,
            -integralLimitError,
            integralLimitError
        );
      } else {
        pidIntegralError = 0.0f;
      }

      const float rawDerivative =
          (state.error - pidPreviousError) / dtSeconds;
      pidFilteredDerivative +=
          FILTRO_DERIVADA *
          (rawDerivative - pidFilteredDerivative);
      derivative = pidFilteredDerivative;
    }
  } else {
    pidHasPreviousSample = true;
  }

  pidPreviousError = state.error;
  pidPreviousUpdateUs = nowUs;

  state.pTerm = state.effectiveKp * state.error;
  state.iTerm = constrain(
      KI * pidIntegralError,
      -LIMITE_INTEGRAL_GRADOS,
      LIMITE_INTEGRAL_GRADOS
  );
  state.dTerm = KD * derivative;

  float correctionDegrees =
      static_cast<float>(DIRECCION_SERVO) *
      (state.pTerm + state.iTerm + state.dTerm);

  correctionDegrees = constrain(
      correctionDegrees,
      -static_cast<float>(SERVO_RECORRIDO_MAXIMO_GRADOS),
      static_cast<float>(SERVO_RECORRIDO_MAXIMO_GRADOS)
  );

  state.servoAngle = static_cast<int>(
      roundf(SERVO_CENTRO_GRADOS + correctionDegrees)
  );

