daiilvvyeyo/WRO-2026-Future-Engineers-Superiores/codes/ESP32_Open_Optimizado.ino
  // El SG90 no necesita recibir saltos de decenas de grados por una sola
  // lectura ruidosa. El objetivo final se conserva y se alcanza por pasos.
  state.servoAngle = constrain(
      state.servoAngle,
      currentServoAngle - PASO_MAXIMO_SERVO_POR_LECTURA_GRADOS,
      currentServoAngle + PASO_MAXIMO_SERVO_POR_LECTURA_GRADOS
  );

  const float cornerSpeed =
      VELOCIDAD_MOTOR_PORCENTAJE -
      state.cornerFactor *
          (VELOCIDAD_MOTOR_PORCENTAJE -
           VELOCIDAD_MOTOR_EN_ESQUINA_PORCENTAJE);
  const float lateralWallSpeed =
      VELOCIDAD_MOTOR_PORCENTAJE -
      state.lateralWallFactor *
          (VELOCIDAD_MOTOR_PORCENTAJE -
           VELOCIDAD_MINIMA_PARED_LATERAL_PORCENTAJE);

  // No suma reducciones: toma la velocidad mas segura de las dos.
  state.speedPercent = static_cast<uint8_t>(
      roundf(fminf(cornerSpeed, lateralWallSpeed))
  );

  applyQuarterTurnGuard(
      nowMs,
      state.servoAngle,
      state.speedPercent
  );

  writeServoAngle(state.servoAngle);
  setMotorSpeedPercent(state.speedPercent);

  return state;
}

// ------------------------- Comunicacion I2C --------------------------

bool sendBrightnessPercent(uint8_t percent) {
  if (percent > 100) {
    percent = 100;
  }

  Wire.beginTransmission(NANO_I2C_ADDRESS);
  Wire.write(percent);
  const uint8_t error = Wire.endTransmission();

  if (error != 0) {
    Serial.print("Error I2C al enviar intensidad. Codigo: ");
    Serial.println(error);
    return false;
  }

  return true;
}

void updateCornerLedIndicator(float cornerFactor) {
  const bool cornerDetected = cornerFactor > 0.0f;

  if (cornerDetected == ledsIndicandoEsquina) {
    return;
  }

  const uint8_t targetBrightness =
      cornerDetected ? BRILLO_LED_EN_ESQUINA_PORCENTAJE
                     : brilloLedBasePorcentaje;

  if (!sendBrightnessPercent(targetBrightness)) {
    return;
  }

  ledsIndicandoEsquina = cornerDetected;
  Serial.print("Indicador de esquina: LEDs ");
  Serial.print(cornerDetected ? "encendidos al " : "restaurados al ");
  Serial.print(targetBrightness);
  Serial.println("%.");
}

bool readDistancesMm(uint16_t outputMm[SENSOR_COUNT]) {
  const uint8_t received = Wire.requestFrom(
      static_cast<uint8_t>(NANO_I2C_ADDRESS),
      static_cast<uint8_t>(DISTANCE_PACKET_BYTES)
  );

  if (received != DISTANCE_PACKET_BYTES) {
    Serial.print("Respuesta I2C incompleta: ");
    Serial.print(received);
    Serial.print("/");
    Serial.println(DISTANCE_PACKET_BYTES);

    while (Wire.available()) {
      Wire.read();
    }
    return false;
  }

  for (uint8_t i = 0; i < SENSOR_COUNT; ++i) {
    const uint8_t lowByte = Wire.read();
    const uint8_t highByte = Wire.read();
    const uint16_t decodedDistance =
        static_cast<uint16_t>(lowByte) |
        (static_cast<uint16_t>(highByte) << 8);
    outputMm[i] = decodedDistance == INVALID_DISTANCE_MM
                      ? DISTANCIA_SIN_ECO_MM
                      : decodedDistance;
  }

  return true;
}

bool updateStartupCorridorClassification(
    const uint16_t distancesMm[SENSOR_COUNT]
) {
  if (startupCorridorClassified) {
    return true;
  }

  const uint16_t leftDistanceMm = distancesMm[0];   // S1, 90 grados
  const uint16_t rightDistanceMm = distancesMm[4];  // S5, 90 grados
  if (leftDistanceMm == INVALID_DISTANCE_MM ||
      rightDistanceMm == INVALID_DISTANCE_MM) {
    return false;
  }

  startupCorridorWidthAccumulatorMm +=
      static_cast<uint32_t>(leftDistanceMm) + rightDistanceMm;
  ++startupCorridorSampleCount;

  if (startupCorridorSampleCount < MUESTRAS_PARA_CLASIFICAR_PASILLO) {
    return false;
  }

  startupCorridorWidthMm = static_cast<uint16_t>(
      startupCorridorWidthAccumulatorMm / startupCorridorSampleCount
  );
  startupCorridorIsWide =
      startupCorridorWidthMm >= UMBRAL_PASILLO_ANCHO_MM;
  selectedFinalAdvanceDurationMs = startupCorridorIsWide
      ? DURACION_AVANCE_FINAL_PASILLO_ANCHO_MS
      : DURACION_AVANCE_FINAL_PASILLO_ANGOSTO_MS;
  startupCorridorClassified = true;

  Serial.print("Pasillo inicial clasificado como ");
  Serial.print(startupCorridorIsWide ? "ANCHO" : "ANGOSTO");
  Serial.print(": S1 + S5 promedio = ");
  Serial.print(startupCorridorWidthMm / 10);
  Serial.print(".");
  Serial.print(startupCorridorWidthMm % 10);
  Serial.print(" cm; avance final = ");
  Serial.print(selectedFinalAdvanceDurationMs);
  Serial.println(" ms.");
  return true;
}

void printDistances(const uint16_t distancesMm[SENSOR_COUNT]) {
  for (uint8_t i = 0; i < SENSOR_COUNT; ++i) {
    Serial.print("S");
    Serial.print(i + 1);
    Serial.print(": ");

    if (distancesMm[i] == INVALID_DISTANCE_MM) {
      Serial.print("sin eco");
    } else {
      // Imprime centimetros con un decimal, sin usar float.
      Serial.print(distancesMm[i] / 10);
      Serial.print(".");
      Serial.print(distancesMm[i] % 10);
      Serial.print(" cm");
    }

    if (i < SENSOR_COUNT - 1) {
      Serial.print(" | ");
    }
  }

  Serial.println();
}

void printControlState(const ControlState &state) {
  Serial.print("Error: ");
  Serial.print(state.error, 1);
  Serial.print(" | Rampa Kp: ");
  Serial.print(state.startupKpFactor * 100.0f, 0);
  Serial.print("%");
  Serial.print(" | Kp efectivo: ");
  Serial.print(state.effectiveKp, 4);
  Serial.print(" | P: ");
  Serial.print(state.pTerm, 1);
  Serial.print(" I: ");
  Serial.print(state.iTerm, 1);
  Serial.print(" D: ");
  Serial.print(state.dTerm, 1);
  Serial.print(" | Esquina: ");
  Serial.print(state.cornerFactor * 100.0f, 0);
  Serial.print("% | Proteccion lateral: ");
  Serial.print(state.lateralWallFactor * 100.0f, 0);
  Serial.print("% | Servo: ");
  Serial.print(state.servoAngle);
  Serial.print(" grados | Velocidad objetivo: ");
  Serial.print(state.speedPercent);
  Serial.print("% | Velocidad aplicada: ");
  Serial.print(velocidadAplicadaPorcentaje);
  Serial.print("% | Rumbo: ");
  Serial.print(currentYawDegrees, 1);
  Serial.print(" grados | Giro acumulado: ");
  Serial.print(accumulatedTurnDegrees, 1);
  Serial.print(" grados | Vueltas: ");
  Serial.print(completedLaps);
  Serial.print("/");
  Serial.println(VUELTAS_OBJETIVO);
}

// ---------------------- Control desde el monitor ---------------------

// Escribe un numero de 0 a 100 y Enter en el monitor serial.
// En el programa final tambien puedes llamar directamente a:
//   sendBrightnessPercent(valor);
void handleSerialBrightnessCommand() {
  static char input[8];
  static uint8_t length = 0;
  uint8_t processedBytes = 0;

  while (processedBytes < MAX_SERIAL_BYTES_PER_LOOP && Serial.available()) {
    ++processedBytes;
    const char character = static_cast<char>(Serial.read());

