daiilvvyeyo/WRO-2026-Future-Engineers-Superiores/codes/ESP32_Open_Optimizado.ino
    if (character == '\r' || character == '\n') {
      if (length == 0) {
        continue;
      }

      input[length] = '\0';
      char *endPointer = nullptr;
      const long value = strtol(input, &endPointer, 10);

      if (*endPointer == '\0' && value >= 0 && value <= 100) {
        brilloLedBasePorcentaje = static_cast<uint8_t>(value);

        if (ledsIndicandoEsquina) {
          Serial.print("Intensidad base guardada: ");
          Serial.print(value);
          Serial.println("%. Se aplicara al salir de la esquina.");
        } else if (sendBrightnessPercent(brilloLedBasePorcentaje)) {
          Serial.print("Intensidad enviada al Nano: ");
          Serial.print(value);
          Serial.println("%");
        }
      } else {
        Serial.println("Valor invalido. Escribe un numero de 0 a 100.");
      }

      length = 0;
      continue;
    }

    if (length < sizeof(input) - 1) {
      input[length++] = character;
    } else {
      // Si la linea es demasiado larga, se descarta.
      length = 0;
      Serial.println("Entrada demasiado larga.");
    }
  }
}

// ----------------------------- Arduino -------------------------------

void setup() {
  Serial.begin(115200);

  beginEncoder();

  Wire.begin(
      ESP32_SDA_PIN,
      ESP32_SCL_PIN,
      I2C_FREQUENCY_HZ
  );
  Wire.setTimeOut(I2C_TRANSACTION_TIMEOUT_MS);
  beginBno085I2c();

  servoPwmReady = beginServoPwm();
  if (servoPwmReady) {
    writeServoAngle(SERVO_CENTRO_GRADOS);
  } else {
    Serial.println("ERROR: no se pudo iniciar el PWM del servo.");
  }

  motorPwmReady = beginMotorPwm();
  if (motorPwmReady) {
    stopMotor();
  } else {
    Serial.println("ERROR: no se pudo iniciar el PWM del motor.");
  }

  delay(10);

  // Estado seguro al arrancar: tira apagada.
  sendBrightnessPercent(brilloLedBasePorcentaje);

  beginDashboard();

  Serial.println();
  Serial.println("ESP32 maestro I2C listo.");
  Serial.print("Servo centrado en ");
  Serial.print(SERVO_CENTRO_GRADOS);
  Serial.println(" grados.");
  Serial.println("Motor detenido; arrancara al recibir sensores por I2C.");
  Serial.print("Encoder: A=D5, B=D9. PWM de espera: ");
  Serial.print(VELOCIDAD_DETECCION_ARRANQUE_PORCENTAJE);
  Serial.println("%.");
  Serial.print("BNO085 I2C en SDA=21/SCL=22. Objetivo: ");
  Serial.print(VUELTAS_OBJETIVO);
  Serial.println(" vueltas.");
  Serial.println("Esperando el primer paquete de rumbo para habilitar motor.");
  Serial.println("Escribe una intensidad de 0 a 100 y presiona Enter.");
}

void loop() {
  handleSerialBrightnessCommand();
  updateDashboard();

  static unsigned long lastPollMs = 0;
  static unsigned long lastValidSensorMs = 0;
  const unsigned long nowMs = millis();

  updateBno085(nowMs);
  updateFinalAdvance(nowMs);
  updateFinalReverse(nowMs);

  if (lapTrackingActive && !missionComplete && bno085HasHeading &&
      nowMs - lastBno085FrameMs >= BNO085_FAILSAFE_TIMEOUT_MS) {
    if (!bno085FailsafeActive) {
      bno085FailsafeActive = true;

      if (finalReverseActive) {
        Serial.println(
            "Ajuste final cancelado: se perdio el rumbo del BNO085."
        );
        finishThreeLapMission();
      } else if (EXIGIR_BNO085_PARA_MOVERSE) {
        stopMotor();
        writeServoAngle(SERVO_CENTRO_GRADOS);
        Serial.println("Motor detenido: sin datos de rumbo del BNO085.");
      } else {
        Serial.println(
            "AVISO: sin BNO085; continua movimiento sin conteo de vueltas."
        );
      }
    }
  }

  if (nowMs - lastPollMs >= SENSOR_POLL_INTERVAL_MS) {
    lastPollMs = nowMs;

    uint16_t distancesMm[SENSOR_COUNT];
    if (readDistancesMm(distancesMm)) {
      lastValidSensorMs = nowMs;
      distanceSensorFailsafeActive = false;

      for (uint8_t i = 0; i < SENSOR_COUNT; ++i) {
        latestDistancesMm[i] = distancesMm[i];
      }

      // Mantiene el robot quieto durante las primeras muestras para que la
      // medida S1 + S5 represente el ancho real del pasillo de arranque.
      if (!updateStartupCorridorClassification(distancesMm)) {
        if (velocidadObjetivoPorcentaje > 0 ||
            velocidadAplicadaPorcentaje > 0) {
          stopMotor();
        }
        writeServoAngle(SERVO_CENTRO_GRADOS);
        return;
      }

      static unsigned long lastPrintMs = 0;
      const float cornerFactor = calculateCornerFactor(distancesMm[2]);

      // Al completar tres vueltas el paro queda enclavado. El BNO085 solo
      // bloquea el movimiento si EXIGIR_BNO085_PARA_MOVERSE esta activado.
      const bool bno085BlocksMovement =
          EXIGIR_BNO085_PARA_MOVERSE &&
          (!bno085HasHeading || bno085FailsafeActive);

      if (missionComplete || bno085BlocksMovement) {
        if (velocidadObjetivoPorcentaje > 0 ||
            velocidadAplicadaPorcentaje > 0 || retrocesoEscapeActivo) {
          stopMotor();
          writeServoAngle(SERVO_CENTRO_GRADOS);
        }
        return;
      }

      // El ajuste de llegada controla motor y servo desde updateFinalReverse().
      if (finalReverseActive) {
        return;
      }

      const bool reversing = updateReverseEscape(distancesMm[2], nowMs);

      updateCornerLedIndicator(cornerFactor);

      if (reversing) {
        if (nowMs - lastPrintMs >= SERIAL_PRINT_INTERVAL_MS) {
          lastPrintMs = nowMs;
          printDistances(distancesMm);

          if (retrocesoEscapeFrenando) {
            Serial.println(
                "Escape activo: frenando, servo centrado."
            );
          } else if (retrocesoEscapeLimiteAlcanzado) {
            Serial.println(
                "Escape en espera: motor detenido, servo centrado."
            );
          } else {
            Serial.print("Escape activo: retroceso al ");
            Serial.print(VELOCIDAD_RETROCESO_ESCAPE_PORCENTAJE);
            Serial.println("%, servo centrado.");
          }
        }
      } else {
        const ControlState state =
            updatePidControl(distancesMm, nowMs);

        updateMotorSoftStart(nowMs);

        if (nowMs - lastPrintMs >= SERIAL_PRINT_INTERVAL_MS) {
          lastPrintMs = nowMs;
          printDistances(distancesMm);
          printControlState(state);
        }
      }
    }
  }

  // Mantiene la rampa fluida aun entre dos consultas I2C.
  const bool bno085AllowsMovement =
      !EXIGIR_BNO085_PARA_MOVERSE ||
      (bno085HasHeading && !bno085FailsafeActive);

  if (!missionComplete && !finalReverseActive && bno085AllowsMovement &&
      !retrocesoEscapeActivo) {
    updateMotorSoftStart(nowMs);
  }

  if ((velocidadObjetivoPorcentaje > 0 || retrocesoEscapeActivo) &&
      nowMs - lastValidSensorMs >= SENSOR_FAILSAFE_TIMEOUT_MS) {
    if (finalReverseActive) {
      Serial.println(
          "Ajuste final cancelado: se perdieron los sensores de distancia."
      );
      distanceSensorFailsafeActive = true;
      finishThreeLapMission();
      updateCornerLedIndicator(0.0f);
      return;
    }

    retrocesoEscapeActivo = false;
    retrocesoEscapeLimiteAlcanzado = false;
    stopMotor();
    updateCornerLedIndicator(0.0f);

    if (!distanceSensorFailsafeActive) {
      distanceSensorFailsafeActive = true;
      Serial.println("Motor detenido: sin datos I2C de sensores.");
    }
  }
}
